Hey @nakamorichi! 👋🏼 

Your example works in my environment without any issues. 
```
❯ tofu apply -auto-approve

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # proxmox_virtual_environment_file.test_snippet will be created
  + resource "proxmox_virtual_environment_file" "test_snippet" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = "test"
          + file_name = "test.txt"
          + resize    = 0
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
proxmox_virtual_environment_file.test_snippet: Creating...
proxmox_virtual_environment_file.test_snippet: Creation complete after 1s [id=local:snippets/test.txt]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

In fact, all examples (like [here](https://github.com/bpg/terraform-provider-proxmox/blob/main/example/resource_virtual_environment_file.tf#L10) or [here](https://github.com/bpg/terraform-provider-proxmox/blob/main/examples/guides/clone-vm/cloud-config.tf#L10)) are regularly tested, at least once before each release.

The snippet upload is using SSH, so there could be some specifics of your configuration that prevent provider from successfully upload the file. Unfortunately, the log you provided is not enough to investigate further. There should be records above that line containing information about the ssh connection establishment and commands used to copy the file. Could you provide those, and also additional details about your ssh config? If you can paste your provider's config that would be great.

Also please check https://registry.terraform.io/providers/bpg/proxmox/latest/docs#ssh-connection
Make sure you can do `ssh terraform@<target-node> sudo pvesm apiinfo` (or `root@<target-node>` if you haven't set up a separate user account for the provider) without a password prompt.


